import React, { useEffect, useState } from 'react';
import { StyleSheet, useWindowDimensions, View } from 'react-native';
import { Dropdown } from 'react-native-element-dropdown';

const data = [
{ label: 'АДМИНИСТРАЦИЯ МУНИЦИПАЛЬНОГО ОБРАЗОВАНИЯ "СОЛЯНСКИЙ НАСЛЕГ" ОЛЕКМИНСКОГО РАЙОНА РЕСПУБЛИКИ САХА (ЯКУТИЯ)', value: 'АДМИНИСТРАЦИЯ МУНИЦИПАЛЬНОГО ОБРАЗОВАНИЯ "СОЛЯНСКИЙ НАСЛЕГ" ОЛЕКМИНСКОГО РАЙОНА РЕСПУБЛИКИ САХА (ЯКУТИЯ)' },
{ label: 'АДМИНИСТРАЦИЯ ПОСЕЛКА ГОРОДСКОГО ТИПА МАГДАГАЧИ', value: 'АДМИНИСТРАЦИЯ ПОСЕЛКА ГОРОДСКОГО ТИПА МАГДАГАЧИ' },
{ label: 'АДМИНИСТРАЦИЯ ЯМАЛЬСКОГО РАЙОНА', value: 'АДМИНИСТРАЦИЯ ЯМАЛЬСКОГО РАЙОНА' },
{ label: 'АКЦИОНЕРНОЕ ОБЩЕСТВО "АБЗ-ДОРСТРОЙ"', value: 'АКЦИОНЕРНОЕ ОБЩЕСТВО "АБЗ-ДОРСТРОЙ"' },
{ label: 'АО "АТГС"', value: 'АО "АТГС"' },
{ label: 'АО "ГАЗПРОМ ОРГЭНЕРГОГАЗ"', value: 'АО "ГАЗПРОМ ОРГЭНЕРГОГАЗ"' },
{ label: 'АО "ГАЗПРОМ ШЕЛЬФПРОЕКТ"', value: 'АО "ГАЗПРОМ ШЕЛЬФПРОЕКТ"' },
{ label: 'АО "ГАЗСТРОЙПРОЕКТ"', value: 'АО "ГАЗСТРОЙПРОЕКТ"' },
{ label: 'АО "ГАЗСТРОЙПРОМ"', value: 'АО "ГАЗСТРОЙПРОМ"' },
{ label: 'АО "ГК "ЕКС"', value: 'АО "ГК "ЕКС"' },
{ label: 'АО "ГМС НЕФТЕМАШ"', value: 'АО "ГМС НЕФТЕМАШ"' },
{ label: 'АО "ГСП"', value: 'АО "ГСП"' },
{ label: 'АО "ИНФОСИСТЕМЫ ДЖЕТ"', value: 'АО "ИНФОСИСТЕМЫ ДЖЕТ"' },
{ label: 'АО "ИСКРА-Р"', value: 'АО "ИСКРА-Р"' },
{ label: 'АО "КМПО"', value: 'АО "КМПО"' },
{ label: 'АО "ЛАБОРАТОРИЯ ППШ"', value: 'АО "ЛАБОРАТОРИЯ ППШ"' },
{ label: 'АО "ЛЕНГАЗСПЕЦСТРОЙ"', value: 'АО "ЛЕНГАЗСПЕЦСТРОЙ"' },
{ label: 'АО "ЛИМБ"', value: 'АО "ЛИМБ"' },
{ label: 'АО "НЕФТЕАВТОМАТИКА"', value: 'АО "НЕФТЕАВТОМАТИКА"' },
{ label: 'АО "НИПЦ ГНТ"', value: 'АО "НИПЦ ГНТ"' },
{ label: 'АО "ОМСКИЙ ЭМЗ"', value: 'АО "ОМСКИЙ ЭМЗ"' },
{ label: 'АО "ПК "ТТ"', value: 'АО "ПК "ТТ"' },
{ label: 'АО "ПРЕМЬЕРСТРОЙ"', value: 'АО "ПРЕМЬЕРСТРОЙ"' },
{ label: 'АО "ПРОЕКТНЕФТЕГАЗ"', value: 'АО "ПРОЕКТНЕФТЕГАЗ"' },
{ label: 'АО "РОСИНЖИНИРИНГ"', value: 'АО "РОСИНЖИНИРИНГ"' },
{ label: 'АО "РНГМ-ГРУПП"', value: 'АО "РНГМ-ГРУПП"' },
{ label: 'АО "РУСГАЗДОБЫЧА"', value: 'АО "РУСГАЗДОБЫЧА"' },
{ label: 'АО "РЭПХОЛДИНГ"', value: 'АО "РЭПХОЛДИНГ"' },
{ label: 'АО "СВАРОЧНО-МОНТАЖНЫЙ ТРЕСТ"', value: 'АО "СВАРОЧНО-МОНТАЖНЫЙ ТРЕСТ"' },
{ label: 'АО "СИБНЕФТЕМАШ"', value: 'АО "СИБНЕФТЕМАШ"' },
{ label: 'АО "СИП РС"', value: 'АО "СИП РС"' },
{ label: 'АО "СМТ"', value: 'АО "СМТ"' },
{ label: 'АО "СТНГ"', value: 'АО "СТНГ"' },
{ label: 'АО "СТРОЙГАЗМОНТАЖ"', value: 'АО "СТРОЙГАЗМОНТАЖ"' },
{ label: 'АО "СТРОЙГАЗОЙЛ"', value: 'АО "СТРОЙГАЗОЙЛ"' },
{ label: 'АО "СТРОЙТРАНСНЕФТЕГАЗ"', value: 'АО "СТРОЙТРАНСНЕФТЕГАЗ"' },
{ label: 'АО "ТЕПЛОХИМ"', value: 'АО "ТЕПЛОХИМ"' },
{ label: 'АО "ТЭМЗ"', value: 'АО "ТЭМЗ"' },
{ label: 'АО "УРОМГАЗ"', value: 'АО "УРОМГАЗ"' },
{ label: 'АО "УФА-АВИАГАЗ"', value: 'АО "УФА-АВИАГАЗ"' },
{ label: 'АО "ЦЕНТРЭНЕРГОГАЗ"', value: 'АО "ЦЕНТРЭНЕРГОГАЗ"' },
{ label: 'АО "ЯМАЛТРАНССТРОЙ"', value: 'АО "ЯМАЛТРАНССТРОЙ"' },
{ label: 'АО ГК "ЕКС"', value: 'АО ГК "ЕКС"' },
{ label: 'ЗАО "БЕЗОПАСНЫЕ ТЕХНОЛОГИИ"', value: 'ЗАО "БЕЗОПАСНЫЕ ТЕХНОЛОГИИ"' },
{ label: 'ЗАО "ЭТАЛОНПРИБОР"', value: 'ЗАО "ЭТАЛОНПРИБОР"' },
{ label: 'ЗАО "ФИРО-О"', value: 'ЗАО "ФИРО-О"' },
{ label: 'ЗАО "ЯМАЛГАЗИНВЕСТ"', value: 'ЗАО "ЯМАЛГАЗИНВЕСТ"' },
{ label: 'ЗАО НИЦ "ИНКОМСИСТЕМ"', value: 'ЗАО НИЦ "ИНКОМСИСТЕМ"' },
{ label: 'НАДЫМСКОЕ УИРС ООО "ГАЗПРОМ ПОДЗЕМРЕМОНТ УРЕНГОЙ"', value: 'НАДЫМСКОЕ УИРС ООО "ГАЗПРОМ ПОДЗЕМРЕМОНТ УРЕНГОЙ"' },
{ label: 'ОАО "ВОЛГОГРАДНЕФТЕМАШ"', value: 'ОАО "ВОЛГОГРАДНЕФТЕМАШ"' },
{ label: 'ОАО "СИБНЕФТЕТРАНСПРОЕКТ"', value: 'ОАО "СИБНЕФТЕТРАНСПРОЕКТ"' },
{ label: 'ОАО "СУ №2"', value: 'ОАО "СУ №2"' },
{ label: 'ООО "3Д ТЕХНОЛОГИИ"', value: 'ООО "3Д ТЕХНОЛОГИИ"' },
{ label: 'ООО "АВТОМАТИЗАЦИЯ - МЕТРОЛОГИЯ - ЭКСПЕРТ"', value: 'ООО "АВТОМАТИЗАЦИЯ - МЕТРОЛОГИЯ - ЭКСПЕРТ"' },
{ label: 'ООО "АГУНА ТЕПЛО"', value: 'ООО "АГУНА ТЕПЛО"' },
{ label: 'ООО "БАНТЕР ГРУПП"', value: 'ООО "БАНТЕР ГРУПП"' },
{ label: 'ООО "БЕЛТПС"', value: 'ООО "БЕЛТПС"' },
{ label: 'ООО "БРАНД"', value: 'ООО "БРАНД"' },
{ label: 'ООО "ВЕГА-ГАЗ"', value: 'ООО "ВЕГА-ГАЗ"' },
{ label: 'ООО "ВЕЛЕССТРОЙ"', value: 'ООО "ВЕЛЕССТРОЙ"' },
{ label: 'ООО "ВОЛГОДОНСК-ПРИБОР"', value: 'ООО "ВОЛГОДОНСК-ПРИБОР"' },
{ label: 'ООО "ВПТ - НЕФТЕМАШ"', value: 'ООО "ВПТ - НЕФТЕМАШ"' },
{ label: 'ООО "ГАЗАРТСТРОЙ"', value: 'ООО "ГАЗАРТСТРОЙ"' },
{ label: 'ООО "ГАЗИНЖСЕТИ-ТЕХНО"', value: 'ООО "ГАЗИНЖСЕТИ-ТЕХНО"' },
{ label: 'ООО "ГАЗИНФОРМСЕРВИС"', value: 'ООО "ГАЗИНФОРМСЕРВИС"' },
{ label: 'ООО "ГАЗНЕФТЕХОЛДИНГ"', value: 'ООО "ГАЗНЕФТЕХОЛДИНГ"' },
{ label: 'ООО "ГАЗПРОМ БУРЕНИЕ"', value: 'ООО "ГАЗПРОМ БУРЕНИЕ"' },
{ label: 'ООО "ГАЗПРОМ ГЕОТЕХНОЛОГИИ"', value: 'ООО "ГАЗПРОМ ГЕОТЕХНОЛОГИИ"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА АСТРАХАНЬ"', value: 'ООО "ГАЗПРОМ ДОБЫЧА АСТРАХАНЬ"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА ИРКУТСК"', value: 'ООО "ГАЗПРОМ ДОБЫЧА ИРКУТСК"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА НАДЫМ"', value: 'ООО "ГАЗПРОМ ДОБЫЧА НАДЫМ"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА НОЯБРЬСК"', value: 'ООО "ГАЗПРОМ ДОБЫЧА НОЯБРЬСК"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА ОРЕНБУРГ"', value: 'ООО "ГАЗПРОМ ДОБЫЧА ОРЕНБУРГ"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА УРЕНГОЙ"', value: 'ООО "ГАЗПРОМ ДОБЫЧА УРЕНГОЙ"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА ШЕЛЬФ ЮЖНО-САХАЛИНСК"', value: 'ООО "ГАЗПРОМ ДОБЫЧА ШЕЛЬФ ЮЖНО-САХАЛИНСК"' },
{ label: 'ООО "ГАЗПРОМ ДОБЫЧА ЯМБУРГ"', value: 'ООО "ГАЗПРОМ ДОБЫЧА ЯМБУРГ"' },
{ label: 'ООО "ГАЗПРОМ ИНВЕСТ"', value: 'ООО "ГАЗПРОМ ИНВЕСТ"' },
{ label: 'ООО "ГАЗПРОМ КОМПЛЕКТАЦИЯ"', value: 'ООО "ГАЗПРОМ КОМПЛЕКТАЦИЯ"' },
{ label: 'ООО "ГАЗПРОМ ПЕРЕРАБОТКА"', value: 'ООО "ГАЗПРОМ ПЕРЕРАБОТКА"' },
{ label: 'ООО "ГАЗПРОМ ПОДЗЕМРЕМОНТ УРЕНГОЙ"', value: 'ООО "ГАЗПРОМ ПОДЗЕМРЕМОНТ УРЕНГОЙ"' },
{ label: 'ООО "ГАЗПРОМ ПРОЕКТИРОВАНИЕ"', value: 'ООО "ГАЗПРОМ ПРОЕКТИРОВАНИЕ"' },
{ label: 'ООО "ГАЗПРОМ ПХГ"', value: 'ООО "ГАЗПРОМ ПХГ"' },
{ label: 'ООО "ГАЗПРОМ РСИ"', value: 'ООО "ГАЗПРОМ РСИ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ ВОЛГОГРАД"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ ВОЛГОГРАД"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ ЕКАТЕРИНБУРГ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ ЕКАТЕРИНБУРГ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ КАЗАНЬ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ КАЗАНЬ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ КРАСНОДАР"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ КРАСНОДАР"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ МАХАЧКАЛА"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ МАХАЧКАЛА"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ МОСКВА"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ МОСКВА"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ НИЖНИЙ НОВГОРОД"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ НИЖНИЙ НОВГОРОД"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ САМАРА"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ САМАРА"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ САНКТ-ПЕТЕРБУРГ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ САНКТ-ПЕТЕРБУРГ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ САРАТОВ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ САРАТОВ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ СТАВРОПОЛЬ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ СТАВРОПОЛЬ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ СУРГУТ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ СУРГУТ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ ТОМСК"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ ТОМСК"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ УФА"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ УФА"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ УХТА"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ УХТА"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ ЧАЙКОВСКИЙ"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ ЧАЙКОВСКИЙ"' },
{ label: 'ООО "ГАЗПРОМ ТРАНСГАЗ ЮГОРСК"', value: 'ООО "ГАЗПРОМ ТРАНСГАЗ ЮГОРСК"' },
{ label: 'ООО "ГАЗПРОМ ЦПС"', value: 'ООО "ГАЗПРОМ ЦПС"' },
{ label: 'ООО "ГАЗПРОМ ЭНЕРГО"', value: 'ООО "ГАЗПРОМ ЭНЕРГО"' },
{ label: 'ООО "ГАЗПРОМТРАНС"', value: 'ООО "ГАЗПРОМТРАНС"' },
{ label: 'ООО "ГАЗСТРОЙ"', value: 'ООО "ГАЗСТРОЙ"' },
{ label: 'ООО "ГАЗСТРОЙМОНТАЖ"', value: 'ООО "ГАЗСТРОЙМОНТАЖ"' },
{ label: 'ООО "ГАЗСТРОЙПРОЕКТ"', value: 'ООО "ГАЗСТРОЙПРОЕКТ"' },
{ label: 'ООО "ГАЗСТРОЙПРОМ"', value: 'ООО "ГАЗСТРОЙПРОМ"' },
{ label: 'ООО "ГАЗТРУБОПРОВОДСТРОЙ"', value: 'ООО "ГАЗТРУБОПРОВОДСТРОЙ"' },
{ label: 'ООО "ГАЗЭНЕРГОАВТОМАТИКА"', value: 'ООО "ГАЗЭНЕРГОАВТОМАТИКА"' },
{ label: 'ООО "ГАЗЭНЕРГОКОМПЛЕКТ"', value: 'ООО "ГАЗЭНЕРГОКОМПЛЕКТ"' },
{ label: 'ООО "ГАЗЭНЕРГОСЕРВИС"', value: 'ООО "ГАЗЭНЕРГОСЕРВИС"' },
{ label: 'ООО "ГАЗЭНЕРГОСТРОЙ"', value: 'ООО "ГАЗЭНЕРГОСТРОЙ"' },
{ label: 'ООО "ГЕРМЕС ГРУПП"', value: 'ООО "ГЕРМЕС ГРУПП"' },
{ label: 'ООО "ГИДРОАЭРОЦЕНТР"', value: 'ООО "ГИДРОАЭРОЦЕНТР"' },
{ label: 'ООО "ГК "ГРАНИТ"', value: 'ООО "ГК "ГРАНИТ"' },
{ label: 'ООО "ГК "ИНТРАТУЛ"', value: 'ООО "ГК "ИНТРАТУЛ"' },
{ label: 'ООО "ГК "СТРОЙМОНТАЖИНВЕСТ"', value: 'ООО "ГК "СТРОЙМОНТАЖИНВЕСТ"' },
{ label: 'ООО "ГРСК"', value: 'ООО "ГРСК"' },
{ label: 'ООО "ГСП РЕМОНТ"', value: 'ООО "ГСП РЕМОНТ"' },
{ label: 'ООО "ГСП-1"', value: 'ООО "ГСП-1"' },
{ label: 'ООО "ГСП-2"', value: 'ООО "ГСП-2"' },
{ label: 'ООО "ГСП-4"', value: 'ООО "ГСП-4"' },
{ label: 'ООО "ГСП-5"', value: 'ООО "ГСП-5"' },
{ label: 'ООО "ГСП-6"', value: 'ООО "ГСП-6"' },
{ label: 'ООО "ГСП-7"', value: 'ООО "ГСП-7"' },
{ label: 'ООО "ГСП-РЕМОНТ"', value: 'ООО "ГСП-РЕМОНТ"' },
{ label: 'ООО "ГЭА"', value: 'ООО "ГЭА"' },
{ label: 'ООО "ГЭС"', value: 'ООО "ГЭС"' },
{ label: 'ООО "ГЭС-УРАЛ"', value: 'ООО "ГЭС-УРАЛ"' },
{ label: 'ООО "ДКИ"', value: 'ООО "ДКИ"' },
{ label: 'ООО "ЗАКНЕФТЕГАЗСТРОЙ-ПРОМЕТЕЙ"', value: 'ООО "ЗАКНЕФТЕГАЗСТРОЙ-ПРОМЕТЕЙ"' },
{ label: 'ООО "ЗВЕЗДА-ЭНЕРГОКОМПЛЕКС"', value: 'ООО "ЗВЕЗДА-ЭНЕРГОКОМПЛЕКС"' },
{ label: 'ООО "ЗМК-СИБИРЬ"', value: 'ООО "ЗМК-СИБИРЬ"' },
{ label: 'ООО "ЗНГС-ПРОМЕТЕЙ"', value: 'ООО "ЗНГС-ПРОМЕТЕЙ"' },
{ label: 'ООО "ИНВЕСТСТРОЙ"', value: 'ООО "ИНВЕСТСТРОЙ"' },
{ label: 'ООО "ИНЕКС СОЧИ"', value: 'ООО "ИНЕКС СОЧИ"' },
{ label: 'ООО "ИНКОМНЕФТЕРЕМОНТ"', value: 'ООО "ИНКОМНЕФТЕРЕМОНТ"' },
{ label: 'ООО "ИНТЕХСТРОЙ"', value: 'ООО "ИНТЕХСТРОЙ"' },
{ label: 'ООО "ИЦ РЕГИОНАЛЬНЫЕ СИСТЕМЫ"', value: 'ООО "ИЦ РЕГИОНАЛЬНЫЕ СИСТЕМЫ"' },
{ label: 'ООО "КОМОКС"', value: 'ООО "КОМОКС"' },
{ label: 'ООО "КОМПАНИЯ "ТЕХНОТЕКС"', value: 'ООО "КОМПАНИЯ "ТЕХНОТЕКС"' },
{ label: 'ООО "КОРВЕТ"', value: 'ООО "КОРВЕТ"' },
{ label: 'ООО "КУРГАНХИММАШ"', value: 'ООО "КУРГАНХИММАШ"' },
{ label: 'ООО "ЛОФТ"', value: 'ООО "ЛОФТ"' },
{ label: 'ООО "МЕТРОЛОГИЯ И АВТОМАТИЗАЦИЯ"', value: 'ООО "МЕТРОЛОГИЯ И АВТОМАТИЗАЦИЯ"' },
{ label: 'ООО "МЦЭ-ИНЖИНИРИНГ"', value: 'ООО "МЦЭ-ИНЖИНИРИНГ"' },
{ label: 'ООО "НГС"', value: 'ООО "НГС"' },
{ label: 'ООО "НГ-ЭНЕРГО"', value: 'ООО "НГ-ЭНЕРГО"' },
{ label: 'ООО "НГТИИ"', value: 'ООО "НГТИИ"' },
{ label: 'ООО "НЕФТЕГАЗКОМПЛЕКТМОНТАЖ"', value: 'ООО "НЕФТЕГАЗКОМПЛЕКТМОНТАЖ"' },
{ label: 'ООО "НЕФТЕГАЗОВЫЕ ТЕХНОЛОГИИ И ИНЖЕНЕРНЫЕ ИЗЫСКАНИЯ"', value: 'ООО "НЕФТЕГАЗОВЫЕ ТЕХНОЛОГИИ И ИНЖЕНЕРНЫЕ ИЗЫСКАНИЯ"' },
{ label: 'ООО "НЕФТЕГАЗОВЫЕ ТЕХНОЛОГИИ"', value: 'ООО "НЕФТЕГАЗОВЫЕ ТЕХНОЛОГИИ"' },
{ label: 'ООО "НЕФТЕГАЗСТРОЙ"', value: 'ООО "НЕФТЕГАЗСТРОЙ"' },
{ label: 'ООО "НЕФТЕХИМКОМПЛЕКТАЦИЯ"', value: 'ООО "НЕФТЕХИМКОМПЛЕКТАЦИЯ"' },
{ label: 'ООО "НЕФТЕХИММАШ"', value: 'ООО "НЕФТЕХИММАШ"' },
{ label: 'ООО "НЕФТЕХИМРЕМСТРОЙ"', value: 'ООО "НЕФТЕХИМРЕМСТРОЙ"' },
{ label: 'ООО "НЕФТЬ"', value: 'ООО "НЕФТЬ"' },
{ label: 'ООО "НЕФТЬ-ГАЗ"', value: 'ООО "НЕФТЬ-ГАЗ"' },
{ label: 'ООО "НЕФТЬПРОМСТРОЙ"', value: 'ООО "НЕФТЬПРОМСТРОЙ"' },
{ label: 'ООО "НИПИ НГ "ПЕТОН"', value: 'ООО "НИПИ НГ "ПЕТОН"' },
{ label: 'ООО "НПА ВИРА РЕАЛТАЙМ"', value: 'ООО "НПА ВИРА РЕАЛТАЙМ"' },
{ label: 'ООО "НПО "ВЫМПЕЛ"', value: 'ООО "НПО "ВЫМПЕЛ"' },
{ label: 'ООО "НПО "ЭТАЛОН"', value: 'ООО "НПО "ЭТАЛОН"' },
{ label: 'ООО "НПФ "ВИСМА"', value: 'ООО "НПФ "ВИСМА"' },
{ label: 'ООО "НПФ "ГКС"', value: 'ООО "НПФ "ГКС"' },
{ label: 'ООО "НПФ "ИНФОРМАЦИОННЫЕ СИСТЕМЫ БЕЗОПАСНОСТИ"', value: 'ООО "НПФ "ИНФОРМАЦИОННЫЕ СИСТЕМЫ БЕЗОПАСНОСТИ"' },
{ label: 'ООО "НПФ "ИСБ"', value: 'ООО "НПФ "ИСБ"' },
{ label: 'ООО "НПФ "ЛЭА"', value: 'ООО "НПФ "ЛЭА"' },
{ label: 'ООО "НПФ "СИСТЕМА-СЕРВИС"', value: 'ООО "НПФ "СИСТЕМА-СЕРВИС"' },
{ label: 'ООО "ОДК ИНЖИНИРИНГ"', value: 'ООО "ОДК ИНЖИНИРИНГ"' },
{ label: 'ООО "ОЗЭУ"', value: 'ООО "ОЗЭУ"' },
{ label: 'ООО "ОСК-ЦЕНТР"', value: 'ООО "ОСК-ЦЕНТР"' },
{ label: 'ООО "ПМК-710"', value: 'ООО "ПМК-710"' },
{ label: 'ООО "ПНГИ"', value: 'ООО "ПНГИ"' },
{ label: 'ООО "ПО "ТРАНСГАЗ"', value: 'ООО "ПО "ТРАНСГАЗ"' },
{ label: 'ООО "ПОЛИСТРОЙ"', value: 'ООО "ПОЛИСТРОЙ"' },
{ label: 'ООО "ППК ПРОФИГАЗПРОММОНТАЖ"', value: 'ООО "ППК ПРОФИГАЗПРОММОНТАЖ"' },
{ label: 'ООО "ПРИБОРАВТОМАТИКА"', value: 'ООО "ПРИБОРАВТОМАТИКА"' },
{ label: 'ООО "ПРИБОРЭНЕРГОГАЗ"', value: 'ООО "ПРИБОРЭНЕРГОГАЗ"' },
{ label: 'ООО "ПРОМ-А УРАЛ"', value: 'ООО "ПРОМ-А УРАЛ"' },
{ label: 'ООО "ПРОМНЕФТЕГАЗИНЖИНИРИНГ"', value: 'ООО "ПРОМНЕФТЕГАЗИНЖИНИРИНГ"' },
{ label: 'ООО "ПРОМЫШЛЕННАЯ ГРУППА ПРОГРЕССИЯ"', value: 'ООО "ПРОМЫШЛЕННАЯ ГРУППА ПРОГРЕССИЯ"' },
{ label: 'ООО "ПРОФГАЗСТРОЙ"', value: 'ООО "ПРОФГАЗСТРОЙ"' },
{ label: 'ООО "ПРОФ-ИНЖИНИРИНГ"', value: 'ООО "ПРОФ-ИНЖИНИРИНГ"' },
{ label: 'ООО "ПСГ ЭНЕРГИЯ"', value: 'ООО "ПСГ ЭНЕРГИЯ"' },
{ label: 'ООО "ПТИМАШ"', value: 'ООО "ПТИМАШ"' },
{ label: 'ООО "Р.О.С.СТРОЙ"', value: 'ООО "Р.О.С.СТРОЙ"' },
{ label: 'ООО "РЕГИОННЕФТЕГАЗСТРОЙ"', value: 'ООО "РЕГИОННЕФТЕГАЗСТРОЙ"' },
{ label: 'ООО "РОССБИЛДИНГ"', value: 'ООО "РОССБИЛДИНГ"' },
{ label: 'ООО "РСУ УРАЛСТРОЙГАЗ"', value: 'ООО "РСУ УРАЛСТРОЙГАЗ"' },
{ label: 'ООО "РУБЕЖ-М"', value: 'ООО "РУБЕЖ-М"' },
{ label: 'ООО "РУСГАЗШЕЛЬФ"', value: 'ООО "РУСГАЗШЕЛЬФ"' },
{ label: 'ООО "РУССТРОЙ"', value: 'ООО "РУССТРОЙ"' },
{ label: 'ООО "САРАТОВСТРОЙСЕРВИСРЕМОНТ"', value: 'ООО "САРАТОВСТРОЙСЕРВИСРЕМОНТ"' },
{ label: 'ООО "САРРЗ"', value: 'ООО "САРРЗ"' },
{ label: 'ООО "СБ "МАРИТ"', value: 'ООО "СБ "МАРИТ"' },
{ label: 'ООО "СВОД ИНТЕРНЕШНЛ"', value: 'ООО "СВОД ИНТЕРНЕШНЛ"' },
{ label: 'ООО "СВЯЗЬСТРОЙСЕРВИС"', value: 'ООО "СВЯЗЬСТРОЙСЕРВИС"' },
{ label: 'ООО "СВЯЗЬСТРОЙСЕРВИС-44"', value: 'ООО "СВЯЗЬСТРОЙСЕРВИС-44"' },
{ label: 'ООО "СИБЭКС"', value: 'ООО "СИБЭКС"' },
{ label: 'ООО "СИСТЕМЫ ГАЗОВОЙ АВТОМАТИКИ"', value: 'ООО "СИСТЕМЫ ГАЗОВОЙ АВТОМАТИКИ"' },
{ label: 'ООО "СК СЕВЕРНАЯ ГАВАНЬ"', value: 'ООО "СК СЕВЕРНАЯ ГАВАНЬ"' },
{ label: 'ООО "СК СМП"', value: 'ООО "СК СМП"' },
{ label: 'ООО "СНГ"', value: 'ООО "СНГ"' },
{ label: 'ООО "СОЮЗДОНСТРОЙ"', value: 'ООО "СОЮЗДОНСТРОЙ"' },
{ label: 'ООО "СПБ-СМК"', value: 'ООО "СПБ-СМК"' },
{ label: 'ООО "СПЕЦГАЗСТРОЙ"', value: 'ООО "СПЕЦГАЗСТРОЙ"' },
{ label: 'ООО "СПЕЦМОНТАЖ"', value: 'ООО "СПЕЦМОНТАЖ"' },
{ label: 'ООО "СПЕЦПОДВОДТРУБОПРОВОДСТРОЙ"', value: 'ООО "СПЕЦПОДВОДТРУБОПРОВОДСТРОЙ"' },
{ label: 'ООО "СПЕЦПРИВОД"', value: 'ООО "СПЕЦПРИВОД"' },
{ label: 'ООО "СПЕЦСТРОЙИНЖИНИРИНГ"', value: 'ООО "СПЕЦСТРОЙИНЖИНИРИНГ"' },
{ label: 'ООО "ССК "ГАЗРЕГИОН"', value: 'ООО "ССК "ГАЗРЕГИОН"' },
{ label: 'ООО "СТИМУЛ"', value: 'ООО "СТИМУЛ"' },
{ label: 'ООО "СТК ИНЖИНИРИНГ"', value: 'ООО "СТК ИНЖИНИРИНГ"' },
{ label: 'ООО "СТРОИТЕЛЬНАЯ КОМПАНИЯ "СПЕЦСТРОЙМОНТАЖ"', value: 'ООО "СТРОИТЕЛЬНАЯ КОМПАНИЯ "СПЕЦСТРОЙМОНТАЖ"' },
{ label: 'ООО "СТРОЙВЕРС"', value: 'ООО "СТРОЙВЕРС"' },
{ label: 'ООО "СТРОЙГАЗКОНСАЛТИНГ"', value: 'ООО "СТРОЙГАЗКОНСАЛТИНГ"' },
{ label: 'ООО "СТРОЙГАЗМОНТАЖ", ООО "СГМ"', value: 'ООО "СТРОЙГАЗМОНТАЖ", ООО "СГМ"' },
{ label: 'ООО "СТРОЙКОМПЛЕКТМОНТАЖ"', value: 'ООО "СТРОЙКОМПЛЕКТМОНТАЖ"' },
{ label: 'ООО "СТРОЙПРОЕКТСЕРВИС"', value: 'ООО "СТРОЙПРОЕКТСЕРВИС"' },
{ label: 'ООО "СТРОЙЭНЕРГОСЕРВИСГРУПП"', value: 'ООО "СТРОЙЭНЕРГОСЕРВИСГРУПП"' },
{ label: 'ООО "СУПЕРСТРОЙ XXI"', value: 'ООО "СУПЕРСТРОЙ XXI"' },
{ label: 'ООО "ТД "ТМК"', value: 'ООО "ТД "ТМК"' },
{ label: 'ООО "ТД ЭЛЕКТРОАГРЕГАТ"', value: 'ООО "ТД ЭЛЕКТРОАГРЕГАТ"' },
{ label: 'ООО "ТЕЛЕКОМ ИНТЕГРАЦИЯ"', value: 'ООО "ТЕЛЕКОМ ИНТЕГРАЦИЯ"' },
{ label: 'ООО "ТЕЛЕКОМСЕРВИС"', value: 'ООО "ТЕЛЕКОМСЕРВИС"' },
{ label: 'ООО "ТЕПЛОЭНЕРГОСИСТЕМЫ"', value: 'ООО "ТЕПЛОЭНЕРГОСИСТЕМЫ"' },
{ label: 'ООО "ТЕХНОСПЕЦСТРОЙ"', value: 'ООО "ТЕХНОСПЕЦСТРОЙ"' },
{ label: 'ООО "ТРЭМ-КАЗАНЬ"', value: 'ООО "ТРЭМ-КАЗАНЬ"' },
{ label: 'ООО "ТСН-ЭЛЕКТРО"', value: 'ООО "ТСН-ЭЛЕКТРО"' },
{ label: 'ООО "ТЭКСВЯЗЬИНЖИНИРИНГ"', value: 'ООО "ТЭКСВЯЗЬИНЖИНИРИНГ"' },
{ label: 'ООО "УПТТ И СТ ОМГД"', value: 'ООО "УПТТ И СТ ОМГД"' },
{ label: 'ООО "УРАЛСТРОЙТРАСТ"', value: 'ООО "УРАЛСТРОЙТРАСТ"' },
{ label: 'ООО "УРАЛТЕХСИСТЕМЫ"', value: 'ООО "УРАЛТЕХСИСТЕМЫ"' },
{ label: 'ООО "УСТ"', value: 'ООО "УСТ"' },
{ label: 'ООО "УФАНЕФТЕГАЗМАШ"', value: 'ООО "УФАНЕФТЕГАЗМАШ"' },
{ label: 'ООО "УЦСБ"', value: 'ООО "УЦСБ"' },
{ label: 'ООО "ФРАКДЖЕТ-ВОЛГА"', value: 'ООО "ФРАКДЖЕТ-ВОЛГА"' },
{ label: 'ООО "ФРАКДЖЕТ-СТРОЙ"', value: 'ООО "ФРАКДЖЕТ-СТРОЙ"' },
{ label: 'ООО "ФРИС"', value: 'ООО "ФРИС"' },
{ label: 'ООО "ЦЕНТРГАЗ"', value: 'ООО "ЦЕНТРГАЗ"' },
{ label: 'ООО "ЦЕНТРГАЗЭНЕРГОРЕМОНТ"', value: 'ООО "ЦЕНТРГАЗЭНЕРГОРЕМОНТ"' },
{ label: 'ООО "ЦЕНТРСПЕЦАВТОМАТИКА"', value: 'ООО "ЦЕНТРСПЕЦАВТОМАТИКА"' },
{ label: 'ООО "ЦСС"', value: 'ООО "ЦСС"' },
{ label: 'ООО "ЧЭТА"', value: 'ООО "ЧЭТА"' },
{ label: 'ООО "ЭЛСИ СИБИРЬ"', value: 'ООО "ЭЛСИ СИБИРЬ"' },
{ label: 'ООО "ЭНЕРГОМОНТАЖ СК"', value: 'ADMIN' },
{ label: 'ООО "ЯМАЛСТРОЙМЕХАНИЗАЦИЯ"', value: 'ООО "ЯМАЛСТРОЙМЕХАНИЗАЦИЯ"' },
{ label: 'ООО "ЦУП ЧЭАЗ"', value: 'ООО "ЦУП ЧЭАЗ"' },
{ label: 'ООО АВИАПРЕДПРИЯТИЕ "ГАЗПРОМ АВИА"', value: 'ООО АВИАПРЕДПРИЯТИЕ "ГАЗПРОМ АВИА"' },
{ label: 'ООО ЗАВОД "ГАЗПРОММАШ"', value: 'ООО ЗАВОД "ГАЗПРОММАШ"' },
{ label: 'ООО ЗАВОД "КАЛИНИНГРАДГАЗАВТОМАТИКА"', value: 'ООО ЗАВОД "КАЛИНИНГРАДГАЗАВТОМАТИКА"' },
{ label: 'ООО НПП "АММА"', value: 'ООО НПП "АММА"' },
{ label: 'ООО НПП "ПЕНЗНЕФТЕХИММАШ"', value: 'ООО НПП "ПЕНЗНЕФТЕХИММАШ"' },
{ label: 'ООО НПП "ТЭК"', value: 'ООО НПП "ТЭК"' },
{ label: 'ООО НПФ "ГКС"', value: 'ООО НПФ "ГКС"' },
{ label: 'ООО НПФ "ЛЭА"', value: 'ООО НПФ "ЛЭА"' },
{ label: 'ООО ТД "ТМК"', value: 'ООО ТД "ТМК"' },
{ label: 'ООО ФПК "КОСМОС-НЕФТЬ-ГАЗ"', value: 'ООО ФПК "КОСМОС-НЕФТЬ-ГАЗ"' },
{ label: 'ПАО "ГАЗПРОМ АВТОМАТИЗАЦИЯ"', value: 'ПАО "ГАЗПРОМ АВТОМАТИЗАЦИЯ"' },
{ label: 'ПАО "ПОДЗЕМБУРГАЗ"', value: 'ПАО "ПОДЗЕМБУРГАЗ"' },
{ label: 'ООО "ГЭС-СТРОЙ"', value: 'ООО "ГЭС-СТРОЙ"' },
{ label: 'ООО "ГЭК"', value: 'ООО "ГЭК"' },

];

type Props = {
    post: string;
    status: boolean;
    title: string;
    onChange: (status: string) => void;
};

const ListOfOrganizations = ({ post, status, title, onChange }: Props) => {
    const [value, setValue] = useState(post || '');
    const [isFocus, setIsFocus] = useState(false);
    const fontScale = useWindowDimensions().fontScale;

    const ts = (fontSize: number) => {
        return (fontSize / fontScale);
    };

    useEffect(() => {
        // Устанавливаем значение из props при изменении post или status
        if (post !== value && status) {
            setValue(post);
        }
        if (status){
            setValue(post);
        }
    }, [post, status]);

    useEffect(() => {
        // Обновляем родительский компонент при изменении значения
        if (onChange) {
            onChange(value);
        }
    }, [value]);

    return (
        <View style={styles.container}>
            <Dropdown
                style={[styles.dropdown, isFocus && { borderColor: 'blue' }]}
                placeholderStyle={[styles.placeholderStyle, { fontSize: ts(14), lineHeight: ts(20),includeFontPadding: false, textAlignVertical: 'center' }]}
                selectedTextStyle={[styles.selectedTextStyle, { fontSize: ts(14), lineHeight: ts(20),includeFontPadding: false, textAlignVertical: 'center' }]}
                inputSearchStyle={[styles.inputSearchStyle, { fontSize: ts(14), lineHeight: ts(20),includeFontPadding: false, textAlignVertical: 'center' }]}
                iconStyle={styles.iconStyle}
                data={data}
                search
                maxHeight={300}
                itemTextStyle={{ fontSize: ts(14) }}
                labelField="label"
                valueField="value"
                placeholder={!isFocus ? title : 'Не выбрано'}
                searchPlaceholder="Search..."
                value={value}
                onFocus={() => setIsFocus(true)}
                onBlur={() => setIsFocus(false)}
                onChange={item => {
                    setValue(item.value);
                    setIsFocus(false);
                }}
            />
        </View>
    );
};

export default ListOfOrganizations;

const styles = StyleSheet.create({
    container: {
        paddingBottom: 16,
    },
    dropdown: {
        height: 40,
        borderColor: '#D9D9D9',
        borderWidth: 1,
        borderRadius: 8,
        paddingHorizontal: 8,
        width: '96%',
        backgroundColor: '#fff',
        alignItems: 'center',
        justifyContent: 'center',
    },
    icon: {
        marginRight: 5,
    },
    label: {
        position: 'absolute',
        backgroundColor: 'white',
        left: 22,
        top: 8,
        zIndex: 999,
        paddingHorizontal: 8,
        fontSize: 14,
    },
    placeholderStyle: {
        fontSize: 16,
        textAlign: 'center',
        color: '#B3B3B3',
    },
    selectedTextStyle: {
        fontSize: 16,
        color: '#B3B3B3',
        textAlign: 'center',
    },
    iconStyle: {
        width: 20,
        height: 20,
    },
    inputSearchStyle: {
        height: 40,
        fontSize: 16,
    },
});